"""
Задание 1.
Выполнить логические побитовые операции «И», «ИЛИ» и др. над числами 5 и 6. Выполнить над числом 5 побитовый сдвиг
вправо и влево на два знака.
"""
print(f"5 | 6 = {5 | 6}")
print(f"5 & 6 = {5 & 6}")
print(f"5 ^ 6 = {5 ^ 6}")
print(f"5 >> 2 = {5 >> 2}")
print(f"5 << 2 = {5 << 2}")
